/* 
قراره اینجا تمام کارهایی که یوزر تو سایت انجام می ده رو داشته باشیم 

*/
class UserController{
    getProfile(){
        // اطلاعات یوزر رو نمایش می ده
    }
    editProfile(){
        // بتونه اطلاعات خودش ویرایش کنه
    }
    addSkills(){
        // بتونه مهارت جدید برای خودش تعریف کنه 
    }
    editSkills(){
        // ممکنه بخواد سطح یه مهارت تغییر بده یا اون حذف کنه
    }
    acceptInviteInTeam(){
        //تو قسمت تیم ها گفتیم که می تونیم یوزر به تیم اضافه کنیم 
        // حالا متود اینجا قراره به یوزر امکان بده که قبول کنه به تیم اضافه بشه
    }
    rejectInviteInTeam(){
        // رد درخواست ورود به تیم
    }
}
module.exports = {
    UserController : new UserController ()
}